sensorOpt/con/0.5_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       217842;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       218242;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       218442;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       218842;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          109067;
        startFace       219042;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          109067;
        startFace       328109;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          453;
        startFace       437176;
    }
)

// ************************************************************************* //
